### 1. 데이터 불러오기

In [1]:
# import pandas as pd
from sqlalchemy import create_engine 
import pandas as pd
import numpy as np
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@127.0.0.1/xe') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
selloutData = pd.read_sql_query('SELECT * FROM kopo_product_volume', engine) 

# 데이터 VIEW
selloutData.head()

  regionid productgroup yearweek  volume
0      A01       ST0002   201512  151750
1      A01       ST0001   201520  645626
2      A01       ST0002   201520  125863
3      A01       ST0001   201515  810144
4      A01       ST0002   201515  128999

### 2. 그룹바이 심화

### 2-1. 데이터 정렬

In [2]:
sortedData = selloutData.sort_values(["regionid","productgroup","yearweek"])
sortedData.reset_index(inplace=True, drop=True)
sortedData.head()

  regionid productgroup yearweek  volume
0      A01       ST0001   201501  513598
1      A01       ST0001   201502  438251
2      A01       ST0001   201503  420290
3      A01       ST0001   201504  458431
4      A01       ST0001   201505  482381

### 2-2 그룹바이 함수 정의

In [3]:
def sub_function(data):
    data.reset_index(drop=True, inplace=True)
    data["ma"] = data["volume"].rolling(window = 5, center = True, min_periods=1).mean()
    return data

In [11]:
len(sortedData)

210

In [4]:
groupData = sortedData.groupby(["regionid","productgroup"]).apply(sub_function)
groupData.head(10)

                        regionid productgroup yearweek  volume             ma
regionid productgroup
A01      ST0001       0      A01       ST0001   201501  513598  457379.666667
                      1      A01       ST0001   201502  438251  457642.500000
                      2      A01       ST0001   201503  420290  462590.200000
                      3      A01       ST0001   201504  458431  473953.000000
                      4      A01       ST0001   201505  482381  510381.200000
                      5      A01       ST0001   201506  570412  540679.400000
                      6      A01       ST0001   201507  620392  562902.200000
                      7      A01       ST0001   201508  571781  568761.800000
                      8      A01       ST0001   201509  569545  559636.800000
                      9      A01       ST0001   201510  511679  532860.200000

### 2-3. 그룹바이 함수 디버깅

In [11]:
groupDataSet = sortedData.groupby(["regionid","productgroup"])
groupDataSet

In [14]:
len(groupDataSet)

2

In [15]:
data = groupDataSet.get_group(list(groupDataSet.groups)[1])
data.head()

    regionid productgroup yearweek  volume
105      A01       ST0002   201501  155729
106      A01       ST0002   201502  123875
107      A01       ST0002   201503  114744
108      A01       ST0002   201504  137162
109      A01       ST0002   201505  180516